app/controllers/challenges_controller.rb

  def new
    @challenge = Challenge.new
    @challenges = Challenge.all()
---
SELECT "challenges".* FROM "challenges"

  def create
    @challenge = Challenge.new(params[:challenge])

    if @challenge.save
---
INSERT INTO "challenges" ("brand_logo_url", "brand_name", "challenge_location", "challenge_reward", "challenge_type", "created_at", "description", "hero_img_url", "title", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def index
    @challenges = Challenge.all()
---
SELECT "challenges".* FROM "challenges"

  def show
    @challenge = Challenge.find(params[:id])
---
SELECT "challenges".* FROM "challenges" WHERE "challenges"."id" = ? LIMIT 1  [["id", "1"]]

  def edit
    @challenge = Challenge.find(params[:id])
    @challenges = Challenge.all()
---
SELECT "challenges".* FROM "challenges" WHERE "challenges"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "challenges".* FROM "challenges"

  def destroy
    @challenge = Challenge.find(params[:id])
    @challenge.destroy
---
SELECT "challenges".* FROM "challenges" WHERE "challenges"."id" = ? LIMIT 1  [["id", "3"]]
DELETE FROM "challenges" WHERE "challenges"."id" = ?  [["id", 3]]