app/controllers/submissions_controller.rb

SELECT "challenges".* FROM "challenges" WHERE "challenges"."id" = ? LIMIT 1  [["id", "1"]]
---
  def new
    @challenge = Challenge.find(params[:challenge_id])

INSERT INTO "submissions" ("challenge_id", "content_url", "created_at", "description", "updated_at") VALUES (?, ?, ?, ?, ?)  [["challenge_id", 1], ["content_url", ""], ["created_at", Mon, 17 Sep 2012 19:57:47 UTC +00:00], ["description", ""], ["updated_at", Mon, 17 Sep 2012 19:57:47 UTC +00:00]]
---
  def create
    @submission = Submission.new(params[:submission])

    if @submission.save

SELECT "challenges".* FROM "challenges" WHERE "challenges"."id" = ? LIMIT 1  [["id", "1"]]
---
  def index
    @challenge = Challenge.find(params[:challenge_id])

SELECT "submissions".* FROM "submissions" WHERE "submissions"."id" = ? ORDER BY submissions.created_at DESC LIMIT 1  [["id", "1"]]
DELETE FROM "submissions" WHERE "submissions"."id" = ?  [["id", 1]]
---
  def destroy
     @submission = Submission.find(params[:id])
     challenge_id = @submission.challenge_id
     @submission.destroy