app/controllers/users_controller.rb

  def create
    @user = User.new(params[:user])
    if @user.save
---
INSERT INTO "users" ("created_at", "email", "updated_at") VALUES (?, ?, ?)  [["created_at", Sat, 21 Jul 2012 23:19:14 UTC +00:00], ["email", "test"], ["updated_at", Sat, 21 Jul 2012 23:19:14 UTC +00:00]]