app/controllers/web_app_controller.rb

SELECT "challenges".* FROM "challenges"
---
  def mv
    @challenge = Challenge.find(params[:id])
    @challenges = Challenge.all()